/*************************************************************************
	> File Name: string_io.c
	> Author: 
	> Mail: 
	> Created Time: 2017年05月25日 星期四 08时42分23秒
 ************************************************************************/

/********************************************************
*自定义输入函数
*可以做到输入时,丢弃超过指定长度的字符串,并且清空缓冲区
*不提供字符串格式检测功能
*st指向处理后的输入的字符串的首地址
*********************************************************/
#include "header/string_io.h"
char * s_gets(char * st, int n)
{
    char * ret_val;
    int i = 0;

    ret_val = fgets(st, n, stdin);
    if (ret_val)  //即ret_val != NULL
    {
        while (st[i] != '\n' && st[i] != '\0')
            i++;
        if (st[i] == '\n')
            st[i] = '\0';
        else
            while (getchar() != '\n')
            continue;
    }
    return ret_val;
}




